Repository: sugarlabs/slideruler
Catalog: po/*.po
Languages: fa, pt_br, sv, uk

source: Sliderule
fa: خط کش مهندسی
pt_br: Regra de cálculo
sv: Räknesticka
uk: Логарифмічна лінійка

source: a mechanical calculator for multiplication, division, log, and more
fa: یک ماشین حساب مکانیکی برای ضرب، تقسیم، لگاریتم، و غیره
pt_br: uma calculadora mecânica para multiplicação, divisão, registros e mais
sv: En mekanisk kalkylator för multiplikation, division, logaritm med mera
uk: механічний калькулятор для множення, ділення, взяття логарифмів тощо

source: square/square root
fa: توان دو (مربع)\ جذر(ریشه دوم)
pt_br: quadrado/raiz quadrada
sv: kvadrat/kvadratrot
uk: квадрат/квадратний корінь

source: multiply/divide
fa: ضرب کردن \تقسیم کردن
pt_br: multiplicar/dividir
sv: multiplicera/dividera
uk: множення/ділення

source: divide/multiply
fa: تقسیم کردن\ضرب کردن
pt_br: dividir/multiplicar
sv: dividera/multiplicera
uk: ділення/множення

source: cube/cube root
fa: مکعب (توان سوم)\ریشه سوم
pt_br: cubo/raiz cúbica
sv: kub/tredjerot
uk: куб/кубічний корінь

source: sin, asin
fa: سینوس، a سینوس
pt_br: sen, asen
uk: sin, arcsin

source: tan, atan
fa: تانژانت، a تانژانت
uk: tg, arctg

source: add/subtract
fa: اضافه کردن\تفریق کردن
pt_br: adição/subtração
sv: addera/subtrahera
uk: додавання/віднімання

source: natural log
fa: لگاریتم طبیعی
pt_br: logaritmo natural
sv: naturlig logaritm
uk: натуральний логарифм

source: Edit
fa: ویرایش کردن
pt_br: Editar
sv: Redigera
uk: Змінити

source: select function
fa: انتخاب تابع
pt_br: selecionar função
sv: välj funktion
uk: виберіть функцію

source: active slide
fa: اسلاید فعال
pt_br: eslaide ativo
sv: aktiv slid
uk: рухома шкала

source: select slide
fa: انتخاب اسلاید
pt_br: selecionar eslaide
sv: välj slid
uk: виберіть рухоме значення

source: active stator
fa: فعال کردن استاتور (قسمت ثابت ماشین یا مولد)
pt_br: estator ativo
sv: aktiv stav
uk: нерухома шкала

source: select stator
fa: انتخاب کردن استاتور
pt_br: selecionar estator
sv: välj stav
uk: виберіть нерухоме значення

source: realign slides
fa: تراز کردن اسلایدها
pt_br: realinhar eslaides
sv: justera om slider
uk: вирівняти шкали

source: create custom slide
fa: ایجاد کردن اسلاید معمولی (مرسوم)
pt_br: criar eslaide personalizada
sv: skapa anpassad slid
uk: створити нетипову рухому шкалу

source: create custom stator
fa: ایجادکردن یک استاتور معمولی
pt_br: criar estator personalizado
sv: skapa anpassad stav
uk: створити нетипову нерухому шкалу

source: position function
fa: موقعیت تابع
pt_br: posição da função
sv: positionsfunktion
uk: функція позиції

source: result function
fa: نتیجه تابع
pt_br: resultado da função
sv: resultatfunktion
uk: функція результату

source: label function
fa: علامت تابع
pt_br: etiqueta da função
sv: etikettfunktion
uk: мітка функції

source: domain minimum
fa: حداقل دامنه
pt_br: domínio mínimo
sv: områdesminimum
uk: мінімум області

source: domain maximum
fa: حداکثر دامنه
pt_br: domínio máximo
sv: områdesmaximum
uk: максимум області

source: step size
fa: سایز مرحله (گام)
pt_br: tamanho do passo
sv: stegstorlek
uk: розмір кроку

source: Copy
fa: کپی کردن
pt_br: Copiar
sv: Kopiera
uk: Копіювати

source: Paste
fa: چسباندن
pt_br: Colar
sv: Klistra in
uk: Вставити

source: log²
fa: لگاریتم ۲

source: log
fa: لگاریتم

source: 1/log
fa: ۱/لگاریتم

source: log³
fa: لگاریتم ۳

source: sin
fa: سینوس
pt_br: sen

source: tan
fa: تانژانت
uk: tg

source: linear
fa: خطی
sv: linjär
uk: лінійна

source: log log
fa: لگاریتم لگاریتم

source: ln
fa: لگاریتم

source: user defined
fa: کاربر تعریف شده
pt_br: definido pelo usuário
sv: användardefinierad
uk: визначене користувачем

source: Overflow Error
fa: خطای اضافی (بیش از اندازه)
pt_br: Erro de transbordamento
sv: Överspillsfel
uk: Помилка переповнення

source: Name Error
fa: خطای اسمی
pt_br: Erro de nome
sv: Namnfel
uk: Помилка назви

source: Can not divide by zero
fa: قابل تقسیم بر صفر نمی باشد.
pt_br: Não é possível dividir por zero
sv: Kan inte dividera med noll
uk: Не можна ділити на нуль

source: Type Error
fa: خطای نوعی
pt_br: Erro de digitação
sv: Typfel
uk: Помилка типу

source: Value Error
fa: خطای ارزشی
pt_br: Erro de valor
sv: Värdefel
uk: Помилка значення

source: Syntax Error
fa: خطای نحوی (ترکیبی)
pt_br: Erro de sintaxe
sv: Syntaxfel
uk: Синтаксична помилка

source: L
fa: ال

source: C
fa: سی

source: CI
fa: کلراید
pt_br: Cl
uk: СІ

source: A
fa: ا

source: K
fa: کی

source: S
fa: اس

source: T
fa: تی

source: Quit
fa: خارج شدن
pt_br: Sair
sv: Avsluta
uk: Вийти

source: NaN
fa: سدیم نیتروژن
sv: Ej tal
uk: Не число
