Repository: sugarlabs/slideruler
Catalog: po/gug.po
Languages: gug

source: Sliderule
gug: Teko aipapa.

source: a mechanical calculator for multiplication, division, log, and more
gug: Peteĩ kombutadóra oku'ẽ mbohetave guará, mboja'o, teraguapykuera ha ve.

source: square/square root
gug: Amoha'anga/tapo amoha'anga.

source: multiply/divide
gug: Mboheta/mboja'o.

source: divide/multiply
gug: Mboja’o/mboheta.

source: cube/cube root
gug: Mbohapyra'ã/tapo mbohapyra'ã.

source: sin, asin
gug: Rei, ha rei.

source: add/subtract
gug: Moîve/tembyre.

source: natural log
gug: Garismo ha'ete.

source: Edit
gug: Nohẽ.

source: select function
gug: Poravo hechapyrã.

source: active slide
gug: Ota'anga'o kyre'ỹ.

source: select slide
gug: Poravo ota'anga'o.

source: active stator
gug: Estator kyre'ỹ.

source: select stator
gug: Poravo estator.

source: realign slides
gug: Rembohysýi ota'anga'o.

source: create custom slide
gug: Japo ota'anga'o mboavarekoha.

source: create custom stator
gug: Japo estator mboavarekoha.

source: position function
gug: Henda hechapyrãgui.

source: result function
gug: Temimbopo hechapyrãgui.

source: label function
gug: Terarenda hechapyrãgui.

source: domain minimum
gug: Pu'aka michĩetevéva.

source: domain maximum
gug: Pu'aka tuvichaite.

source: step size
gug: Jakatuha hasa.

source: Copy
gug: Mbohesegua.

source: Paste
gug: Mboja.

source: sin
gug: Ỹre.

source: linear
gug: Ta'anga neapegua.

source: ln
gug: In.

source: user defined
gug: Myesakãpapyre hese oiporúva peteĩ mba'e.

source: Overflow Error
gug: Jejavygui tenyhẽñehẽ.

source: Name Error
gug: Jejavygui téra.

source: Can not divide by zero
gug: Ndaikatui amboja'o rehe mbe'eve.

source: Type Error
gug: Jejavy tekove.

source: Value Error
gug: Jejavy py'aguasu.

source: Syntax Error
gug: Jejavy ñe'ejoapy mbo'e.

source: Quit
gug: Se.
